spec/fixtures/requests/rate/intl_one_package_ground_no_commodity.xml

<env:Envelope xmlns:xsd="http://www.w3.org/2001/XMLSchema"
    xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
    xmlns:env="http://schemas.xmlsoap.org/soap/envelope/">
  <env:Body>
    <n1:RateRequest xmlns:n1="http://fedex.com/ws/rate/v8">
      <n1:WebAuthenticationDetail>
        <n1:UserCredential>
          <n1:Key></n1:Key>
          <n1:Password></n1:Password>
        </n1:UserCredential>
      </n1:WebAuthenticationDetail>
      <n1:ClientDetail>
        <n1:AccountNumber></n1:AccountNumber>
        <n1:MeterNumber></n1:MeterNumber>
      </n1:ClientDetail>
      <n1:Version>
        <n1:ServiceId>crs</n1:ServiceId>
        <n1:Major>8</n1:Major>
        <n1:Intermediate>0</n1:Intermediate>
        <n1:Minor>0</n1:Minor>
      </n1:Version>
      <n1:RequestedShipment>
        <n1:ShipTimestamp></n1:ShipTimestamp>
        <n1:DropoffType>REGULAR_PICKUP</n1:DropoffType>
        <n1:ServiceType>FEDEX_GROUND</n1:ServiceType>
        <n1:PackagingType>YOUR_PACKAGING</n1:PackagingType>
        <n1:TotalWeight>
          <n1:Units>LB</n1:Units>
          <n1:Value>4.3125</n1:Value>
        </n1:TotalWeight>
        <n1:Shipper>
          <n1:Contact>
            <n1:PersonName>Shipper Name</n1:PersonName>
            <n1:PhoneNumber>5555555555</n1:PhoneNumber>
          </n1:Contact>
          <n1:Address>
            <n1:StreetLines>123 4th St</n1:StreetLines>
            <n1:City>Austin</n1:City>
            <n1:StateOrProvinceCode>TX</n1:StateOrProvinceCode>
            <n1:PostalCode>78701</n1:PostalCode>
            <n1:CountryCode>US</n1:CountryCode>
          </n1:Address>
        </n1:Shipper>
        <n1:Recipient>
          <n1:Contact>
            <n1:PersonName>Metrotown Centre</n1:PersonName>
            <n1:PhoneNumber>4444444444</n1:PhoneNumber>
          </n1:Contact>
          <n1:Address>
            <n1:StreetLines>4800 Kingsway</n1:StreetLines>
            <n1:City>Burnaby</n1:City>
            <n1:StateOrProvinceCode>BC</n1:StateOrProvinceCode>
            <n1:PostalCode>V5H4J2</n1:PostalCode>
            <n1:CountryCode>CA</n1:CountryCode>
            <n1:Residential>false</n1:Residential>
          </n1:Address>
        </n1:Recipient>
        <n1:ShippingChargesPayment>
          <n1:PaymentType>SENDER</n1:PaymentType>
          <n1:Payor>
            <n1:AccountNumber>211669799</n1:AccountNumber>
            <n1:CountryCode>US</n1:CountryCode>
          </n1:Payor>
        </n1:ShippingChargesPayment>
        <n1:InternationalDetail>
          <n1:DutiesPayment>
            <n1:PaymentType>SENDER</n1:PaymentType>
            <n1:Payor>
              <n1:AccountNumber>211669799</n1:AccountNumber>
              <n1:CountryCode>US</n1:CountryCode>
            </n1:Payor>
          </n1:DutiesPayment>
          <n1:DocumentContent>NON_DOCUMENTS</n1:DocumentContent>
          <n1:CustomsValue>
            <n1:Currency>USD</n1:Currency>
            <n1:Amount>0</n1:Amount>
          </n1:CustomsValue>
        </n1:InternationalDetail>
        <n1:LabelSpecification>
          <n1:LabelFormatType>COMMON2D</n1:LabelFormatType>
          <n1:ImageType>PDF</n1:ImageType>
          <n1:LabelStockType>PAPER_8.5X11_TOP_HALF_LABEL</n1:LabelStockType>
        </n1:LabelSpecification>
        <n1:RateRequestTypes>LIST</n1:RateRequestTypes>
        <n1:PackageCount>1</n1:PackageCount>
        <n1:PackageDetail>INDIVIDUAL_PACKAGES</n1:PackageDetail>
        <n1:RequestedPackageLineItems>
          <n1:SequenceNumber>1</n1:SequenceNumber>
          <n1:Weight>
            <n1:Units>LB</n1:Units>
            <n1:Value>4.3125</n1:Value>
          </n1:Weight>
          <n1:SpecialServicesRequested>
          </n1:SpecialServicesRequested>
        </n1:RequestedPackageLineItems>
      </n1:RequestedShipment>
    </n1:RateRequest>
  </env:Body>
</env:Envelope>